---
kind: property
id: P:Autodesk.Revit.DB.SymbolGeometryId.SymbolId
source: html/39b90860-d958-7b9e-2975-90c41a36b9e1.htm
---
# Autodesk.Revit.DB.SymbolGeometryId.SymbolId Property

The id of the symbol that is containing the shared geometry.

## Syntax (C#)
```csharp
public ElementId SymbolId { get; }
```